hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32_84_2.h
    /*
        if (i2s->int_st.out_eof) {
            i2s->int_clr.val = i2s->int_raw.val;

            if ( ! gDoneFilling) {
                fillBuffer6();
            } else {
                portBASE_TYPE HPTaskAwoken = 0;
                xSemaphoreGiveFromISR(gTX_sem, &HPTaskAwoken);
                if(HPTaskAwoken == pdTRUE) portYIELD_FROM_ISR();
            }
        }*/

        //Lines pixel[3];
         if (!i2s->int_st.out_eof)
         return;
         i2s->int_clr.val = i2s->int_raw.val;


        if(stopSignal)
        {
           // Serial.println("stop");
            i2sStop();
            runningPixel=false;
            return;
        }
        if(ledToDisplay<=NUM_LEDS_PER_STRIP)
        {






            if(ledToDisplay==NUM_LEDS_PER_STRIP)
            {
                pu( (uint16_t*)dmaBuffers[dmaBufferActive]->buffer);


                /*i2sStop();
                runningPixel=false;
                return;*/
                            stopSignal=true;
            }
            fillbuffer6((uint16_t*)dmaBuffers[dmaBufferActive]->buffer);
            ledToDisplay++;
            dmaBufferActive = (dmaBufferActive + 1)% 2;
            //if(ledToDisplay)
        }
        else
        {
            //if no more pixels then we will read the other buffer and stop
           // if(ledToDisplay==nun_led_per_strip)
             //   ledToDisplay++;
            //if(ledToDisplay==nun_led_per_strip+1)
                stopSignal=true;
        }
    }

    static void transpose8rS32(uint8_t * A, int m, int n, uint8_t * B)
    {
        uint32_t x, y, t;

        // Load the array and pack it into x and y.

       // x = (A[7]<<24)   | (A[6]<<16)   | (A[5]<<8) | A[4];//(A[0]<<24)   | (A[m]<<16)   | (A[2*m]<<8) | A[3*m];
        //y = *(uint16_t*)(A);//(A[3]<<12) | (A[2]<<8) | (A[1]<<4) | A[0];//(A[4*m]<<24) | (A[5*m]<<16) | (A[6*m]<<8) | A[7*m];


        x = (A[0]<<24)   | (A[m]<<16)   | (A[2*m]<<8) | A[3*m];
        y = (A[4*m]<<24) | (A[5*m]<<16) | (A[6*m]<<8) | A[7*m];

        t = (x ^ (x >> 7)) & 0x00AA00AA;  x = x ^ t ^ (t << 7);
       t = (y ^ (y >> 7)) & 0x00AA00AA;  y = y ^ t ^ (t << 7);

        t = (x ^ (x >>14)) & 0x0000CCCC;  x = x ^ t ^ (t <<14);
        t = (y ^ (y >>14)) & 0x0000CCCC;  y = y ^ t ^ (t <<14);

        t = (x & 0xF0F0F0F0) | ((y >> 4) & 0x0F0F0F0F);
        y = ((x << 4) & 0xF0F0F0F0) | (y & 0x0F0F0F0F);
        x = t;

        B[0]=x>>24;    B[n]=x>>16;    B[2*n]=x>>8;  B[3*n]=x;
        B[4*n]=y>>24;  B[5*n]=y>>16;  B[6*n]=y>>8;  B[7*n]=y;
    }




static    void transpose16x1_noinline2(unsigned char *A, uint8_t *B) {
        uint32_t  x, y, x1,y1,t;



        y = *(unsigned int*)(A);
        x = *(unsigned int*)(A+4);
        y1 = *(unsigned int*)(A+8);
#if NBIS2SERIALPINS >= 12
     x1 = *(unsigned int*)(A+12);
#else
    x1=0;
#endif




        // pre-transform x
        t = (x ^ (x >> 7)) & AA;  x = x ^ t ^ (t << 7);
        t = (x ^ (x >>14)) & CC;  x = x ^ t ^ (t <<14);
    
#if NBIS2SERIALPINS >= 12
       t = (x1 ^ (x1 >> 7)) & AA;  x1 = x1 ^ t ^ (t << 7);
       t = (x1 ^ (x1 >>14)) & CC;  x1 = x1 ^ t ^ (t <<14);
#endif
        // pre-transform y
        t = (y ^ (y >> 7)) & AA;  y = y ^ t ^ (t << 7);
        t = (y ^ (y >>14)) & CC;  y = y ^ t ^ (t <<14);
        t = (y1 ^ (y1 >> 7)) & AA;  y1 = y1 ^ t ^ (t << 7);
        t = (y1 ^ (y1 >>14)) & CC;  y1 = y1 ^ t ^ (t <<14);


        // final transform
        t = (x & FF) | ((y >> 4) & FF2);
        y = ((x << 4) & FF) | (y & FF2);
        x = t;
#if NBIS2SERIALPINS >= 12
        t= (x1 & FF) | ((y1 >> 4) & FF2);
        y1 = ((x1 << 4) & FF) | (y1 & FF2);
        x1 = t;
#else
    x1 =((y1 >> 4) & FF2);
    y1 =  (y1 & FF2);
#endif

    /*
        *((uint16_t*)B) = (uint16_t)((y & 0xff) |  (  (y1 & 0xff) << 8 ) )   ;
        B-=offset;
        //B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((y & 0xff00) |((y1&0xff00) <<8))>>8);
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((y & 0xff0000) |((y1&0xff0000) <<8))>>16);
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((y & 0xff000000) >>8 |((y1&0xff000000) ))>>16);
        B-=offset;
        *((uint16_t*)B) =(uint16_t)( (x & 0xff) |((x1&0xff) <<8));
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((x & 0xff00) |((x1&0xff00) <<8))>>8);
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((x & 0xff0000) |((x1&0xff0000) <<8))>>16);
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((x & 0xff000000) >>8 |((x1&0xff000000) ))>>16);
    */

    // *((uint16_t*)(B)) = (uint16_t)(   (   (x & 0xff000000) >>24 |  (  (x1 & 0xff000000) >>16)   )  );
     *((uint16_t*)(B)) = (uint16_t)(((x & 0xff000000) >>8 |((x1&0xff000000) ))>>16);
    //*((uint8_t*)(B))=*((uint8_t*)(&x)+3);
    //*((uint8_t*)(B+1))=*((uint8_t*)(&x1)+2);



   // B[0]= (uint16_t)(   (   (x & 0xff000000) >>24 |  (  (x1&0xff000000) >>16)   )  );
    //B+=48;//offset;
   *((uint16_t*)(B+48)) = (uint16_t)( ((x & 0xff0000) >>16|((x1&0xff0000) >>8)));
   // B[48] = (uint16_t)( ((x & 0xff0000) >>16|((x1&0xff0000) >>8)));
    //+=48;//offset;
        *((uint16_t*)(B+2*48)) = (uint16_t)(((x & 0xff00) |((x1&0xff00) <<8))>>8);
  // B[2*48]  = (uint16_t)(((x & 0xff00) |((x1&0xff00) <<8))>>8);
   // B+=48;//offset;
    *((uint16_t*)(B+3*48)) =(uint16_t)( (x & 0xff) |((x1&0xff) <<8));
  // B[3*48] =(uint16_t)( (x & 0xff) |((x1&0xff) <<8));
     //B+=48;//offset;


    *((uint16_t*)(B+4*48)) = (uint16_t)(((y & 0xff000000) >>8 |((y1&0xff000000) ))>>16);
  // B[4*48]= (uint16_t)(((y & 0xff000000) >>8 |((y1&0xff000000) ))>>16);

   *((uint16_t*)(B+5*48)) = (uint16_t)(((y & 0xff0000) |((y1&0xff0000) <<8))>>16);


    *((uint16_t*)(B+6*48)) = (uint16_t)(((y & 0xff00) |((y1&0xff00) <<8))>>8);
  //  *((uint16_t*)(B+6*48)) = (uint16_t)(( ((y & 0xff00)>>8) |((y1&0xff00) )));

 // B[6*48]=    (uint16_t)(((y & 0xff00) |((y1&0xff00) <<8))>>8);


    *((uint16_t*)(B+7*48)) = (uint16_t)((y & 0xff) |  (  (y1 & 0xff) << 8 ) )   ;
   //  B[7*48]  = (uint16_t)((y & 0xff) |  (  (y1 & 0xff) << 8 ) )   ;

