hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32_84_2.h
      //on va en strip7
       poli-=I2S_OFF3;
       buff++;

#ifndef STATIC_COLOR_PER_PIN
    for(int pin=0;pin<NBIS2SERIALPINS;pin++) {
        
        //uint32_t l=ledToDisplay+nun_led_per_strip*line+pin*nun_led_per_strip*5;
        
        
        firstPixel[C_G].bytes[pin] = green_map[(*poli).g];//(*poli).g/brightness_g; //scale8(int_leds[l].g,brightness_g);
        firstPixel[C_R].bytes[pin] = red_map[(*poli).r];//(*poli).r/brightness_r;
        firstPixel[C_B].bytes[pin] =blue_map[(*poli).b];//(*poli).b/brightness_b;
        //l+=nun_led_per_strip*NUM_VIRT_PINS;
        poli+=I2S_OFF;
        
        
    }
#else
#if NBIS2SERIALPINS >=1
    firstPixel[C1_G].bytes[0] = green_map[(*poli).g];
    firstPixel[C1_R].bytes[0] = red_map[(*poli).r];
    firstPixel[C1_B].bytes[0] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    
#if NBIS2SERIALPINS >=2
    firstPixel[C2_G].bytes[1] = green_map[(*poli).g];
    firstPixel[C2_R].bytes[1] = red_map[(*poli).r];
    firstPixel[C2_B].bytes[1] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    
#if NBIS2SERIALPINS >=3
    firstPixel[C3_G].bytes[2] = green_map[(*poli).g];
    firstPixel[C3_R].bytes[2] = red_map[(*poli).r];
    firstPixel[C3_B].bytes[2] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    
#if NBIS2SERIALPINS >=4
    firstPixel[C4_G].bytes[3] = green_map[(*poli).g];
    firstPixel[C4_R].bytes[3] = red_map[(*poli).r];
    firstPixel[C4_B].bytes[3] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    // poli+=I2S_OFF;
#if NBIS2SERIALPINS >=5
    firstPixel[C5_G].bytes[4] = green_map[(*poli).g];
    firstPixel[C5_R].bytes[4] = red_map[(*poli).r];
    firstPixel[C5_B].bytes[4] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    // poli+=I2S_OFF;
#if NBIS2SERIALPINS >=6
    firstPixel[C6_G].bytes[5] = green_map[(*poli).g];
    firstPixel[C6_R].bytes[5] = red_map[(*poli).r];
    firstPixel[C6_B].bytes[5] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    //  poli+=I2S_OFF;
#if NBIS2SERIALPINS >=7
    firstPixel[C7_G].bytes[6] = green_map[(*poli).g];
    firstPixel[C7_R].bytes[6] = red_map[(*poli).r];
    firstPixel[C7_B].bytes[6] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    // poli+=I2S_OFF;
#if NBIS2SERIALPINS >=8
    firstPixel[C8_G].bytes[7] = green_map[(*poli).g];
    firstPixel[C8_R].bytes[7] = red_map[(*poli).r];
    firstPixel[C8_B].bytes[7] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    //  poli+=I2S_OFF;
#if NBIS2SERIALPINS >=9
    firstPixel[C9_G].bytes[8] = green_map[(*poli).g];
    firstPixel[C9_R].bytes[8] = red_map[(*poli).r];
    firstPixel[C9_B].bytes[8] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    // poli+=I2S_OFF;
#if NBIS2SERIALPINS >=10
    firstPixel[C10_G].bytes[9] = green_map[(*poli).g];
    firstPixel[C10_R].bytes[9] = red_map[(*poli).r];
    firstPixel[C10_B].bytes[9] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    // poli+=I2S_OFF;
#if NBIS2SERIALPINS >=11
    firstPixel[C11_G].bytes[10] = green_map[(*poli).g];
    firstPixel[C11_R].bytes[10] = red_map[(*poli).r];
    firstPixel[C11_B].bytes[10] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    // poli+=I2S_OFF;
#if NBIS2SERIALPINS >=12
    firstPixel[C12_G].bytes[11] = green_map[(*poli).g];
    firstPixel[C12_R].bytes[11] = red_map[(*poli).r];
    firstPixel[C12_B].bytes[11] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    //poli+=I2S_OFF;
#if NBIS2SERIALPINS >=13
    firstPixel[C13_G].bytes[12] = green_map[(*poli).g];
    firstPixel[C13_R].bytes[12] = red_map[(*poli).r];
    firstPixel[C13_B].bytes[12] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    // poli+=I2S_OFF;
#if NBIS2SERIALPINS >=14
    firstPixel[C14_G].bytes[13] = green_map[(*poli).g];
    firstPixel[C14_R].bytes[13] = red_map[(*poli).r];
    firstPixel[C14_B].bytes[13] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
    // poli+=I2S_OFF;
#if NBIS2SERIALPINS >=15
    firstPixel[C15_G].bytes[14] = green_map[(*poli).g];
    firstPixel[C15_R].bytes[14] = red_map[(*poli).r];
    firstPixel[C15_B].bytes[14] =blue_map[(*poli).b];
    poli+=I2S_OFF;
#endif
#endif




                   transpose16x1_noinline2(firstPixel[0].bytes,(uint8_t*)(buff));
    transpose16x1_noinline2(firstPixel[1].bytes,(uint8_t*)(buff+192));
      transpose16x1_noinline2(firstPixel[2].bytes,(uint8_t*)(buff+384));

}


    /** Start I2S transmission
     */
    static void i2sStart()
    {
        // esp_intr_disable(gI2S_intr_handle);
        // Serial.println("I2S start");
        i2sReset();
        //Serial.println(dmaBuffers[0]->sampleCount());
        i2s->lc_conf.val=I2S_OUT_DATA_BURST_EN | I2S_OUTDSCR_BURST_EN | I2S_OUT_DATA_BURST_EN;
        //i2s.rx_eof_num = dmaBuffers[2]->sampleCount();
        i2s->out_link.addr = (uint32_t) & (dmaBuffers[2]->descriptor);
            //i2s.in_link.addr = (uint32_t) & (dmaBuffers[2]->descriptor);
        i2s->out_link.start = 1;
        ////vTaskDelay(5);
        i2s->int_clr.val = i2s->int_raw.val;
        // //vTaskDelay(5);
        i2s->int_ena.out_dscr_err = 1;
        //enable interrupt
        ////vTaskDelay(5);
        esp_intr_enable(gI2S_intr_handle);
        // //vTaskDelay(5);
        i2s->int_ena.val = 0;
        i2s->int_ena.out_eof = 1;

        //start transmission
        i2s->conf.tx_start = 1;
    }

    static void i2sReset()
    {
        // Serial.println("I2S reset");
        const unsigned long lc_conf_reset_flags = I2S_IN_RST_M | I2S_OUT_RST_M | I2S_AHBM_RST_M | I2S_AHBM_FIFO_RST_M;
        i2s->lc_conf.val |= lc_conf_reset_flags;
        i2s->lc_conf.val &= ~lc_conf_reset_flags;

        const uint32_t conf_reset_flags = I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M | I2S_TX_RESET_M | I2S_TX_FIFO_RESET_M;
        i2s->conf.val |= conf_reset_flags;
        i2s->conf.val &= ~conf_reset_flags;
    }

    static void i2sReset_DMA()
    {
        i2s->lc_conf.in_rst=1; i2s->lc_conf.in_rst=0;
        i2s->lc_conf.out_rst=1; i2s->lc_conf.out_rst=0;
    }

    static void i2sReset_FIFO()
    {
        i2s->conf.rx_fifo_reset=1; i2s->conf.rx_fifo_reset=0;
        i2s->conf.tx_fifo_reset=1; i2s->conf.tx_fifo_reset=0;
    }

    static void i2sStop()
    {
        // Serial.println("I2S stop");
        esp_intr_disable(gI2S_intr_handle);
        i2sReset();
        i2s->conf.rx_start = 0;
        i2s->conf.tx_start = 0;
    }
};

FASTLED_NAMESPACE_END
